# -*-coding: EUC-KR -*-
import pygame
#############################################################################################
# 기본 초기화 (반드시 해야 하는 것들)
pygame.init() # 초기화 

# 화면 크기 설정
screen_width = 980;
screen_height = 720;
screen = pygame.display.set_mode((screen_width, screen_height))

# 화면 타이틀 설정
pygame.display.set_caption("공부하는데 방해하지마!!!") # 게임 이름

# FPS
clock = pygame.time.Clock()
#############################################################################################

#############################################################################################

# 1. 사용자 게임 초기화 (배경 화면, 게임 이미지, 좌표, 속도, 폰트 등)

# 배경 이미지 불러오기

# 스프라이트(캐릭터) 불러오기

# 캐릭터 기본 이동 속도

# 이동할 좌표

# 적 enemy 캐릭터

# 폰트 정의

# 게임 총 시간

# 시작 시간 정보

# 이벤트 루프
running = True # 게임이 진행중인가?
while running:
    dt = clock.tick(60) # 게임화면의 초당 프레임 수를 설정

    # 2. 이벤트 처리 (키보드, 마우스 등)
    for event in pygame.event.get(): # 어떤 이벤트가 발생하였는가?
        if event.type == pygame.QUIT: # 창이 닫히는 이벤트가 발생하였는가?
            running = False # 게임이 진행중이 아님
        
        # 키보드 이벤트가 발생한 경우

    # 3. 게임 캐릭터 위치 정의    
    
    # 가로 경계값 처리
        
    # 세로 경계값 처리
    
    # 4. 충돌 처리
    
    #충돌 체크
    
    # 5. 화면에 그리기 
    
    # 타이머 집어 넣기
    
    pygame.display.update() # 게임화면을 다시 그리기!

# pygame 종료
pygame.quit()

